verification/glm53-moe-fullmodel/candidate-r1/benchmark/cohort-01.log
INFO 09-18 02:15:44 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-18 02:15:44 [__init__.py:46] - neuron -> vllm_neuron:register
INFO 09-18 02:15:44 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
2026-09-18 02:15:45,945 - INFO - staged_neff_load.py:105 - neff_load_registered|name=neuron_libtorch|wrapped=libtorch_neuronx_lite.compile.backend.compile|was_registered=False
2026-09-18 02:15:45,945 - INFO - staged_neff_load.py:105 - neff_load_registered|name=neuron_libtorch|wrapped=libtorch_neuronx_lite.compile.backend.compile|was_registered=False
2026-09-18 02:15:45,946 - INFO - xla_collectives.py:214 - ✓ Custom XLA implementations registered via torch.library.impl (all_reduce, all_gather, reduce_scatter, all_to_all)
2026-09-18 02:15:45,947 - INFO - port_hold_patch.py:205 - Port-hold patch applied (EADDRINUSE file-rendezvous)
2026-09-18 02:15:45,947 - INFO - port_hold_patch.py:205 - Port-hold patch applied (EADDRINUSE file-rendezvous)
INFO 09-18 02:15:46 [__init__.py:237] Platform plugin neuron is activated
WARNING 09-18 02:15:51 [interface.py:358] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a9ee1b3a0c0>, trust_remote_code=False, seed=0, num_prompts=10, dataset_name='custom', no_stream=False, dataset_path='/home/ubuntu/glm53-moe-fullmodel-20260917/harness/workload.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=32, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:18004', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='/home/ubuntu/glm53-moe-fullmodel-20260917/models/GLM-5.3-Flash-04c4e9e9', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/home/ubuntu/glm53-moe-fullmodel-20260917/artifacts/candidate-r1/benchmark', result_filename='cohort-01.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-84264d88-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 10/10 [01:19<00:00,  7.90s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  79.03     
Total input tokens:                      301       
Total generated tokens:                  320       
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         4.05      
Peak output token throughput (tok/s):    9.00      
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          7.86      
---------------Time to First Token----------------
Mean TTFT (ms):                          4404.13   
Median TTFT (ms):                        4403.15   
P99 TTFT (ms):                           4408.35   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          112.86    
Median TPOT (ms):                        112.75    
P99 TPOT (ms):                           113.78    
---------------Inter-token Latency----------------
Mean ITL (ms):                           112.86    
Median ITL (ms):                         113.61    
P99 ITL (ms):                            118.06    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          7902.80   
Median E2EL (ms):                        7901.09   
P99 E2EL (ms):                           7930.66   
==================================================